In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [10]:
df = pd.DataFrame(randn(5,4),['A',"B",'C','D','E'] , ['W',"X",'Y','Z'])

In [11]:
df

          W         X         Y         Z
A -0.961799  0.284871  0.599142 -0.334350
B -0.134058  1.537871  0.905043  0.767150
C -0.497042  1.887770  0.709963  1.331850
D  0.021537 -1.192844 -0.769203 -0.567704
E  0.791297  0.084601 -1.598449 -0.270699

In [13]:
bool  = df>0

In [14]:
df[bool]

          W         X         Y        Z
A       NaN  0.284871  0.599142      NaN
B       NaN  1.537871  0.905043  0.76715
C       NaN  1.887770  0.709963  1.33185
D  0.021537       NaN       NaN      NaN
E  0.791297  0.084601       NaN      NaN

In [15]:
df[df>0]

          W         X         Y        Z
A       NaN  0.284871  0.599142      NaN
B       NaN  1.537871  0.905043  0.76715
C       NaN  1.887770  0.709963  1.33185
D  0.021537       NaN       NaN      NaN
E  0.791297  0.084601       NaN      NaN

In [16]:
df['W']>0

A    False
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [17]:
df['W']

A   -0.961799
B   -0.134058
C   -0.497042
D    0.021537
E    0.791297
Name: W, dtype: float64

In [18]:
df[df['W']>0]

          W         X         Y         Z
D  0.021537 -1.192844 -0.769203 -0.567704
E  0.791297  0.084601 -1.598449 -0.270699

In [19]:
df

          W         X         Y         Z
A -0.961799  0.284871  0.599142 -0.334350
B -0.134058  1.537871  0.905043  0.767150
C -0.497042  1.887770  0.709963  1.331850
D  0.021537 -1.192844 -0.769203 -0.567704
E  0.791297  0.084601 -1.598449 -0.270699

In [20]:
df[df['Z']<0]

          W         X         Y         Z
A -0.961799  0.284871  0.599142 -0.334350
D  0.021537 -1.192844 -0.769203 -0.567704
E  0.791297  0.084601 -1.598449 -0.270699

In [21]:
df[df['W']>0]

          W         X         Y         Z
D  0.021537 -1.192844 -0.769203 -0.567704
E  0.791297  0.084601 -1.598449 -0.270699

In [22]:
df[df['W']>0][['Y','X']]

          Y         X
D -0.769203 -1.192844
E -1.598449  0.084601

In [23]:
5&6

4

In [24]:
6&7

6

In [25]:
12&18

0